class RenewPrefLocations < ActiveRecord::Migration
  
  extend MigrationHelpers 
  
  def self.up
    
    [{:name => "北海道",  :lat => 43.064301, :lng => 141.346874},
    {:name => "青森",  :lat => 40.824622, :lng => 140.740598},
    {:name => "岩手",  :lat => 39.7036, :lng => 141.152709},
    {:name => "宮城",  :lat => 38.268812, :lng => 140.872082},
    {:name => "秋田",  :lat => 39.718611, :lng => 140.102401},
    {:name => "山形",  :lat => 38.240422, :lng => 140.363592},
    {:name => "福島",  :lat => 37.750301, :lng => 140.467522},
    {:name => "茨城",  :lat => 36.341793, :lng => 140.446802},
    {:name => "栃木",  :lat => 36.566672, :lng => 139.883093},
    {:name => "群馬",  :lat => 36.390698, :lng => 139.060451},
    {:name => "埼玉",  :lat => 35.857431, :lng => 139.648901},
    {:name => "千葉",  :lat => 35.605045, :lng => 140.123325},
    {:name => "東京",  :lat => 35.689753, :lng => 139.691731},
    {:name => "神奈川",  :lat => 35.447495, :lng => 139.6424},
    {:name => "新潟",  :lat => 37.902419, :lng => 139.023225},
    {:name => "富山",  :lat => 36.695275, :lng => 137.211342},
    {:name => "石川",  :lat => 36.59473, :lng => 136.625582},
    {:name => "福井",  :lat => 36.065219, :lng => 136.221682},
    {:name => "山梨",  :lat => 35.664161, :lng => 138.568459},
    {:name => "長野",  :lat => 36.651296, :lng => 138.181239},
    {:name => "岐阜",  :lat => 35.391228, :lng => 136.722311},
    {:name => "静岡",  :lat => 34.976944, :lng => 138.383009},
    {:name => "愛知",  :lat => 35.180344, :lng => 136.906632},
    {:name => "三重",  :lat => 34.730272, :lng => 136.508598},
    {:name => "滋賀",  :lat => 35.004528, :lng => 135.868607},
    {:name => "京都",  :lat => 35.021393, :lng => 135.755439},
    {:name => "大阪",  :lat => 34.686555, :lng => 135.519474},
    {:name => "兵庫",  :lat => 34.691287, :lng => 135.183061},
    {:name => "奈良",  :lat => 34.685326, :lng => 135.832751},
    {:name => "和歌山",  :lat => 34.226041, :lng => 135.167504},
    {:name => "鳥取",  :lat => 35.503867, :lng => 134.237716},
    {:name => "島根",  :lat => 35.472324, :lng => 133.05052},
    {:name => "岡山",  :lat => 34.661759, :lng => 133.934399},
    {:name => "広島",  :lat => 34.396603, :lng => 132.459621},
    {:name => "山口",  :lat => 34.18613, :lng => 131.470497},
    {:name => "徳島",  :lat => 34.065756, :lng => 134.559297},
    {:name => "香川",  :lat => 34.340045, :lng => 134.043369},
    {:name => "愛媛",  :lat => 33.841669, :lng => 132.765371},
    {:name => "高知",  :lat => 33.5597, :lng => 133.531096},
    {:name => "福岡",  :lat => 33.606781, :lng => 130.418307},
    {:name => "佐賀",  :lat => 33.24957, :lng => 130.299804},
    {:name => "長崎",  :lat => 32.744814, :lng => 129.8737},
    {:name => "熊本",  :lat => 32.789816, :lng => 130.74169},
    {:name => "大分",  :lat => 33.238205, :lng => 131.612625},
    {:name => "宮崎",  :lat => 31.911058, :lng => 131.423883},
    {:name => "鹿児島",  :lat => 31.560166, :lng => 130.557994},
    {:name => "沖縄",  :lat => 26.212418, :lng => 127.680895}].each{|v|
      
      if (Location.exists?(:name => v[:name]))
        loc = Location.find_by_name(v[:name])
        loc.lat = v[:lat]
        loc.lng = v[:lng]
        loc.save!
      else
        Location.new(:name => v[:name], :lng => v[:lng], :lat => v[:lat]).save!
      end
      
    }
  end
  
end
